// /*
// 개 
 
// 시간 제한	메모리 제한	제출	정답	맞힌 사람	정답 비율
// 1 초	256 MB	555358	236805	207662	43.289%
// 문제
// 아래 예제와 같이 개를 출력하시오.

// 입력
// 없음.

// 출력
// 개를 출력한다.

// 예제 입력 1 
// 예제 출력 1 
// |\_/|
// |q p|   /}
// ( 0 )"""\
// |"^"`    |
// ||_/=\\__|
// */

// #include<iostream>
// using namespace std;

// int main(){
//     cout << "|\\_/|" << endl 
//              << "|q p|   /\}" << endl 
//              << "\( 0 \)\"\"\"\\" << endl 
//              << "|\"^\"\`    |"<< endl
//              << "||_/=\\\\__|";
// }