// /*
// 별 찍기 - 11
 
// 시간 제한	메모리 제한	제출	정답	맞힌 사람	정답 비율
// 1 초	256 MB	47154	21949	16090	44.721%
// 문제
// 예제를 보고 규칙을 유추한 뒤에 별을 찍어 보세요.

// 입력
// 첫째 줄에 N이 주어진다. N은 항상 3×2k 수이다. (3, 6, 12, 24, 48, ...) (0 ≤ k ≤ 10, k는 정수)

// 출력
// 첫째 줄부터 N번째 줄까지 별을 출력한다.

// 예제 입력 1 
// 24
// 예제 출력 1 
//                        *                        
//                       * *                       
//                      *****                      
//                     *     *                     
//                    * *   * *                    
//                   ***** *****                   
//                  *           *                  
//                 * *         * *                 
//                *****       *****                
//               *     *     *     *               
//              * *   * *   * *   * *              
//             ***** ***** ***** *****             
//            *                       *            
//           * *                     * *           
//          *****                   *****          
//         *     *                 *     *         
//        * *   * *               * *   * *        
//       ***** *****             ***** *****       
//      *           *           *           *      
//     * *         * *         * *         * *     
//    *****       *****       *****       *****    
//   *     *     *     *     *     *     *     *   
//  * *   * *   * *   * *   * *   * *   * *   * *  
// ***** ***** ***** ***** ***** ***** ***** *****
// */

// #include<cstdio>
 
// char DB[][6]=
// { "  *  ",
//   " * * ",
//   "*****" };
// char MAP[3500][6500];
 
// void solve(int n, int y, int x)
// {
//     if (n == 1)
//     {
//         for (int i = 0; i < 3; i++)
//             for (int j = 0; j < 5; j++)
//                 MAP[y + i][x + j] = DB[i][j];
//         return;
//     }
//     solve(n / 2, y, x + 3 * n / 2);
//     solve(n / 2, y + 3 * n / 2, x);
//     solve(n / 2, y + 3 * n / 2, x + 3 * n);
// }
 
// int main()
// {
//     int n;
//     scanf("%d", &n);
//     solve(n / 3, 0, 0);
//     for(int i=0;i<n;i++,puts(""))
//         for(int j=0;j<2*n-1;j++)
//             printf("%c", MAP[i][j] == '*' ? '*' : ' ');
//     return 0;
// }
